
const Filter = ({ hide }: { hide: boolean }) => {
    return (
        <div className={hide ? 'filter_div' : 'hide filter_div'}>

            <p> Active Students</p >
            <div className='infos'>
                <div className="info">
                    <p>1.1</p>
                    <p>Патруллик йўналиши хизмат олиб борилган вақтда жиноят содир этилмаган кунлар</p>
                </div>
                <div className="info">
                    <p>1.2</p>
                    <p>Йўналишда хизмат вақтида кўча ва жамоат жойда содир этилган жиноятлар сони</p>
                </div>
                <div className="info">
                    <p>1.2.1</p>
                    <p>Ушбу жиноятнинг йўналишдаги ходим томонидан “иссиқ издан” очилиши</p>
                </div>
                <div className="info">
                    <p>1.3</p>
                    <p>Ходим томонидан ёки унинг ташаббуси билан олди олинган жиноятлар сони</p>
                </div>
                <div className="info">
                    <p>1.4</p>
                    <p>Ходим томонидан шахсан фош этилган қотиллик, талончилик, босқинчилик, ҚБОШЕ,
                        ўғрилик, безорилик сони (1.2.1-банддагидан ташқари)</p>
                </div>
                <div className="info">
                    <p>1.5</p>
                    <p>Ходим томонидан шахсан фош этилган бошқа жиноятлар / Ходим иштирокида фош этилган жиноятлар (жиноятларнинг барча тури учун)
                        / Ходим томонидан аниқланган қидирувда бўлган ва/ёки бедарак йўқолган шахслар сони</p>
                </div>
            </div>

        </div>
    )
}

export default Filter